<%@ Page Language="C#" AutoEventWireup="true" CodeBehind="ImportBook5Level.aspx.cs" Inherits="HospitalBookWebSite.Home.ImportBook5Level" ValidateRequest="false" %>

<!DOCTYPE html>

<html xmlns="http://www.w3.org/1999/xhtml">
<head runat="server">
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title></title>
</head>
<body>
    <form id="form1" runat="server">
        <table>
            <tr>
                <td>
                    第一级：<asp:TextBox ID="txtLevelOne" runat="server" Width="29px">部分</asp:TextBox>
                    第二级:<asp:TextBox ID="txtLevelTwo" runat="server" Width="25px">篇</asp:TextBox>
                    第三级：<asp:TextBox ID="txtLevelThree" runat="server" Width="28px">章</asp:TextBox>
                    第四级:<asp:TextBox ID="txtLevelFour" runat="server" Width="29px">节</asp:TextBox>
                    第五级:<asp:TextBox ID="txtLevelFive" runat="server" Width="29px">点</asp:TextBox>
                    <br />
                    <asp:TextBox ID="txtBook" runat="server" Height="271px" TextMode="MultiLine" Width="412px">第一部分 基础医学综合
    第一篇　口腔医学专业基础
         第一章　口腔组织病理学
              第一节　牙 体 组 织
		第一点　牙 体 组 织
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
		第二点　牙 体 组 织2
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
              第二节　牙 体 组 织
		第一点　牙 体 组 织
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
		第二点　牙 体 组 织2
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
          第二章　口腔组织病理学
              第一节　牙 体 组 织
		第一点　牙 体 组 织
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
		第二点　牙 体 组 织2
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
              第二节　牙 体 组 织
		第一点　牙 体 组 织
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
		第二点　牙 体 组 织2
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
    第二篇　口腔医学专业基础
         第一章　口腔组织病理学
              第一节　牙 体 组 织
		第一点　牙 体 组 织
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
		第二点　牙 体 组 织2
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
              第二节　牙 体 组 织
		第一点　牙 体 组 织
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
		第二点　牙 体 组 织2
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
          第二章　口腔组织病理学
              第一节　牙 体 组 织
		第一点　牙 体 组 织
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
		第二点　牙 体 组 织2
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
              第二节　牙 体 组 织
		第一点　牙 体 组 织
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
		第二点　牙 体 组 织2
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
第二部分 基础医学综合
    第一篇　口腔医学专业基础
         第一章　口腔组织病理学
              第一节　牙 体 组 织
		第一点　牙 体 组 织
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
		第二点　牙 体 组 织2
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
              第二节　牙 体 组 织
		第一点　牙 体 组 织
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
		第二点　牙 体 组 织2
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
          第二章　口腔组织病理学
              第一节　牙 体 组 织
		第一点　牙 体 组 织
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
		第二点　牙 体 组 织2
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
              第二节　牙 体 组 织
		第一点　牙 体 组 织
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
		第二点　牙 体 组 织2
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
    第二篇　口腔医学专业基础
         第一章　口腔组织病理学
              第一节　牙 体 组 织
		第一点　牙 体 组 织
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
		第二点　牙 体 组 织2
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
              第二节　牙 体 组 织
		第一点　牙 体 组 织
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
		第二点　牙 体 组 织2
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
          第二章　口腔组织病理学
              第一节　牙 体 组 织
		第一点　牙 体 组 织
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
		第二点　牙 体 组 织2
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
              第二节　牙 体 组 织
		第一点　牙 体 组 织
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
		第二点　牙 体 组 织2
		考点必备
		考点1：牙齿中最硬的组织是釉质，由占总重量96%～97%的无机物以及少量有机物和水组成。
		考点2：牙体由釉质、牙本质、牙骨质、牙髓组成。
              </asp:TextBox></td>
                <td>&nbsp;<asp:Button ID="btnImport0" runat="server" Height="145px" OnClick="btnImport0_Click" Text="1、转换--&gt;" Width="86px" />
                    &nbsp;</td>
                <td>
                    <asp:TextBox ID="txtBookxml" runat="server" Height="265px" TextMode="MultiLine" Width="412px"></asp:TextBox></td>
            </tr>
            <tr><td></td><td></td><td><asp:Button ID="btnTransfor2" runat="server" Height="44px"  Text="2、转换--&gt;" Width="353px" OnClick="btnTransfor2_Click" />
                    </td></tr>
            <tr>
                <td>
                    <asp:TextBox ID="txtResult" runat="server" Height="334px" TextMode="MultiLine" Width="412px" style="margin-bottom: 0px"></asp:TextBox></td>
                <td>



                    选择书籍：<asp:DropDownList ID="ddlBook" runat="server">
                    </asp:DropDownList>



            <asp:Button ID="btnCheck" runat="server" OnClick="btnCheck_Click" Text="3、检查XML" Height="48px" Width="95px" />
                    <br />
                    <asp:Label ID="Label1" runat="server" ForeColor="#FF3300"></asp:Label>
                    <br />
                    <asp:Button ID="btnImportDB" runat="server" Height="119px" OnClick="btnImportDB_Click" Text="&lt;-4、导入DB" Width="98px" Enabled="False" />
                    &nbsp;<asp:Button ID="btnExportXMLFromDB" runat="server" Height="88px" OnClick="btnExportXMLFromDB_Click" Text="5、导出书籍-&gt;" Width="101px"/>
                    </td>
                <td>
                    <asp:TextBox ID="txtBookXML2" runat="server" Height="314px" TextMode="MultiLine" Width="412px"></asp:TextBox></td>
            </tr>
        </table>
        <div>

            <br />



        </div>
    </form>
</body>
</html>
